---
type: ExportLinetypeInfo
namespace: Autodesk.Revit.DB
version: 2024
members: 5
tags: [revit-api, class]
---

# ExportLinetypeInfo

`Autodesk.Revit.DB.ExportLinetypeInfo` · Revit 2024 · 5 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Constructor | ExportLinetypeInfo | — | `` |
| Constructor | ExportLinetypeInfo | 2014 | `public ExportLinetypeInfo ()` |
| Method | Dispose | — | `public void Dispose ()` |
| Property | DestinationLinetypeName | 2014 | `public string DestinationLinetypeName { get ; set ; }` |
| Property | IsValidObject | 2014 | `public bool IsValidObject { get ; }` |